# Data Missing

deals with missing values.

In [1]:
import pandas as pd

In [2]:
import numpy as np

In [8]:
d={'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [9]:
df=pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [10]:
df.dropna()# drop the row even a single nan vaule is there, by default axis=0

     A    B  C
0  1.0  5.0  1

In [11]:
df.dropna(axis=1) # for column

   C
0  1
1  2
2  3

In [17]:
df.dropna(thresh=2) #here thresh denote no.of values in that row or col

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [18]:
df.fillna(value='FILL')

      A     B  C
0   1.0   5.0  1
1   2.0  FILL  2
2  FILL  FILL  3

In [23]:
df['A'].fillna(value=df['A'].mean())# fill by mean of col A for col A

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [24]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [29]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64